# Set up POSTGRESQL DB and import data from .csv Files
1. Open PG Admin and create a new database.  I called mine "marketing".
2. Run the Open the QuickDBD-export.sql file inside of the database in PGAdmin.
3. Execute only the "create table" blocks of code.  Do not execute the "alter table" blocks.  You can do that after you've imported the data if you'd like.
4. Come back to this file and execute all cells top to bottom.
5. If you wish, return to PG Admin and execute the "alter table" blocks.
6. You should have a working fully normalized db of the marking data. 
7. Create a new .py file and write the queries you'll need for your visualizations.  Use Flask SQLAlchemy.

In [31]:
import pandas as pd
import re
import os

## Import Data from Agency .csv Files

In [78]:
# file directory to import from
data_files = os.listdir('../data_tues/agencies/')
data_files

['2019-media-agencies.csv',
 '2020-effective-agencies.csv',
 '2018-effective-agencies.csv',
 '2019-effective-agencies.csv',
 '2018-creative-agencies.csv',
 '2020-media-agencies.csv',
 '2020-creative-agencies-.csv',
 '2019-creative-agencies.csv',
 '2018-media-agencies.csv']

In [79]:
# function to import data from csv and add columns for year and category from file name
def load_files(filenames):
    regex = re.compile(r'^(\d{4})-(\w+)-agencies\.csv$')
    matches = [m for m in map(regex.match, filenames) if m is not None]

    for match in matches:
	    yield (
            pd.read_csv('../data_tues/agencies/' + match.group(0))
            .assign(year=match.group(1), ranking_category=match.group(2)) 
            .astype({'year': 'int', 'ranking_category': 'string'}) 
        )
		
agencies_data = pd.concat(load_files(data_files))
agencies_data

,Rank,Agency Name,City,Agency Type,Agency Location,Independent?,Product Category,Points,year,ranking_category
0,1,MediaCom Connections,Tel Aviv,Creative Agency,Israel,NaN,"Household & Domestic, Toiletries & Cosmetics",201.7,2019,media
1,2,Touché!,Montreal,Creative Agency,Canada,NaN,"Retail, Soft Drinks, Transport & Tourism",194.0,2019,media
2,3,Mindshare,Shanghai,Creative Agency,China (Mainland),NaN,"Clothing & Accessories, Food, Retail",186.0,2019,media
3,4,UM,Sydney,Creative Agency,Australia,NaN,"Leisure & Entertainment, Soft Drinks, Telecoms...",182.7,2019,media
4,5,MediaCom,London,Creative Agency,UK,NaN,"Business & Industrial, Food, Non-profit, publi...",150.4,2019,media
...,...,...,...,...,...,...,...,...,...,...
1604,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2018,media
1605,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2018,media
1606,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2018,media
1607,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2018,media
1608,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2018,media

## Clean up the Data

In [81]:
# remove na rows (from the bottom of the excel files)
agencies_data = agencies_data.dropna(subset=['Agency Name'])
agencies_data = agencies_data.drop(columns=['Rank'])

In [82]:
# set "Independent" column to boolean fill with true and false vals
d = {'X': True}
agencies_data["Independent?"] = agencies_data["Independent?"].replace(d)
agencies_data['Independent?'] = agencies_data["Independent?"].fillna(False)

In [83]:
#rename the columns
agencies_data = agencies_data.rename(columns={'Agency Name': "name", 'City': 'city', 'Agency Type': 'type', 'Agency Location': 'country', 'Independent?': 'independent', 'Product Category': 'product_category', 'Points': 'points'})

agencies_data

,name,city,type,country,independent,product_category,points,year,ranking_category
0,MediaCom Connections,Tel Aviv,Creative Agency,Israel,False,"Household & Domestic, Toiletries & Cosmetics",201.7,2019,media
1,Touché!,Montreal,Creative Agency,Canada,False,"Retail, Soft Drinks, Transport & Tourism",194.0,2019,media
2,Mindshare,Shanghai,Creative Agency,China (Mainland),False,"Clothing & Accessories, Food, Retail",186.0,2019,media
3,UM,Sydney,Creative Agency,Australia,False,"Leisure & Entertainment, Soft Drinks, Telecoms...",182.7,2019,media
4,MediaCom,London,Creative Agency,UK,False,"Business & Industrial, Food, Non-profit, publi...",150.4,2019,media
...,...,...,...,...,...,...,...,...,...
430,The Electric Factory,Montevideo,Creative Agency,Uruguay,True,Toiletries & Cosmetics,3.0,2018,media
431,Wunderman Phantasia,Lima,Creative Agency,Peru,False,Telecoms & Utilities,3.0,2018,media
432,Laundry Service,London,Creative Agency,UK,True,Technology & Electronics,2.9,2018,media
433,m/SIX,London,Creative Agency,UK,False,Transport & Tourism,2.9,2018,media
434,PMG Worldwide,Fort Worth,Creative Agency,USA,True,Technology & Electronics,2.9,2018,media

## Extract Data for sql Tables and set IDs

### Product Categories Table

In [84]:
# get a list of product categories
product_categories = [val.strip() for sublist in agencies_data["product_category"].dropna().str.split(",").tolist() for val in sublist]
product_categories = list(set(product_categories))
product_categories = pd.DataFrame(product_categories,columns=['name'])
product_categories.insert(0, 'id', range(1, 1 + len(product_categories)))
product_categories.set_index('id', inplace=True)
product_categories

                         name
id
1          Financial Services
2    Technology & Electronics
3   public sector & education
4                 Soft Drinks
5                    Politics
6                  Automotive
7          Media & Publishing
8                  Non-profit
9      Clothing & Accessories
10       Telecoms & Utilities
11    Leisure & Entertainment
12     Toiletries & Cosmetics
13                       Food
14      Business & Industrial
15           Alcoholic Drinks
16        Transport & Tourism
17       Household & Domestic
18                     Retail
19                    Tobacco
20        Pharma & Healthcare

In [ ]:
# // write the data to the postgres db
from sqlalchemy import create_engine
from config import user_name, p_word
engine = create_engine(f'postgresql://{user_name}:{p_word}@localhost:5432/marketing')

In [ ]:
# product_category table
product_categories.to_sql('product_category', engine, if_exists='append')

### Agency Table
1. Get a unique set of agencies - this is a composite of name, city, and type. 
2. Create an "id" for each unique agency.
3. Merge the "id"'s back into the original table.
4. Remove superfluous columns

In [85]:
# get a unique list of agencies
agency = agencies_data.groupby(['name' ,'city' , 'type', 'country']).agg({'independent': 'first'}).reset_index()

#create a unique id for the composite
agency.insert(0, 'id', range(1, 1 + len(agency)))
# agency.set_index('id', inplace=True)
agency

,id,name,city,type,country,independent
0,1,!eatme,Warsaw,Digital/Specialist Agency,Poland,True
1,2,&Co,Copenhagen,Creative Agency,Denmark,True
2,3,&Rosas,Barcelona,Creative Agency,Spain,True
3,4,( anonimo ),Mexico City,Creative Agency,Mexico,True
4,5,(anónimo),Mexico City,Creative Agency,Mexico,True
...,...,...,...,...,...,...
4143,4144,zMessenger,Colombo,Creative Agency,Sri Lanka,True
4144,4145,Åkestam Holst,Stockholm,Creative Agency,Sweden,True
4145,4146,Öppet,Stockholm,Creative Agency,Sweden,True
4146,4147,Über Dijital,Istanbul,Digital/Specialist Agency,Turkey,True
4147,4148,Марк Рейс,Moscow,Creative Agency,Russia,True

In [86]:
merged_df = pd.merge(agencies_data, agency, how="left", on=["name", "city", "type", "country"])
merged_df = merged_df.drop(columns=['independent_y'])
merged_df = merged_df.rename(columns={'independent_x': 'independent'})
id_col = merged_df['id']
merged_df.drop(labels=['id'], axis=1,inplace = True)
merged_df.insert(0, 'id', id_col)
merged_df

,id,name,city,type,country,independent,product_category,points,year,ranking_category
0,2163,MediaCom Connections,Tel Aviv,Creative Agency,Israel,False,"Household & Domestic, Toiletries & Cosmetics",201.7,2019,media
1,3561,Touché!,Montreal,Creative Agency,Canada,False,"Retail, Soft Drinks, Transport & Tourism",194.0,2019,media
2,2275,Mindshare,Shanghai,Creative Agency,China (Mainland),False,"Clothing & Accessories, Food, Retail",186.0,2019,media
3,3648,UM,Sydney,Creative Agency,Australia,False,"Leisure & Entertainment, Soft Drinks, Telecoms...",182.7,2019,media
4,2124,MediaCom,London,Creative Agency,UK,False,"Business & Industrial, Food, Non-profit, publi...",150.4,2019,media
...,...,...,...,...,...,...,...,...,...,...
6358,3484,The Electric Factory,Montevideo,Creative Agency,Uruguay,True,Toiletries & Cosmetics,3.0,2018,media
6359,3941,Wunderman Phantasia,Lima,Creative Agency,Peru,False,Telecoms & Utilities,3.0,2018,media
6360,1789,Laundry Service,London,Creative Agency,UK,True,Technology & Electronics,2.9,2018,media
6361,4114,m/SIX,London,Creative Agency,UK,False,Transport & Tourism,2.9,2018,media
6362,2715,PMG Worldwide,Fort Worth,Creative Agency,USA,True,Technology & Electronics,2.9,2018,media

In [87]:
# create the agency table
agency_df = merged_df.filter(["id", "name", "city", "type", "country", "independent"], axis=1)
agency_df.set_index('id', inplace=True)
agency_df

,name,city,type,country,independent
id,,,,,
2163,MediaCom Connections,Tel Aviv,Creative Agency,Israel,False
3561,Touché!,Montreal,Creative Agency,Canada,False
2275,Mindshare,Shanghai,Creative Agency,China (Mainland),False
3648,UM,Sydney,Creative Agency,Australia,False
2124,MediaCom,London,Creative Agency,UK,False
...,...,...,...,...,...
3484,The Electric Factory,Montevideo,Creative Agency,Uruguay,True
3941,Wunderman Phantasia,Lima,Creative Agency,Peru,False
1789,Laundry Service,London,Creative Agency,UK,True
4114,m/SIX,London,Creative Agency,UK,False
2715,PMG Worldwide,Fort Worth,Creative Agency,USA,True

In [88]:
# remove any duplicate entries
agency_df = agency_df.drop_duplicates(subset=['name', 'city', 'type', 'country'], keep='first')
agency_df

,name,city,type,country,independent
id,,,,,
2163,MediaCom Connections,Tel Aviv,Creative Agency,Israel,False
3561,Touché!,Montreal,Creative Agency,Canada,False
2275,Mindshare,Shanghai,Creative Agency,China (Mainland),False
3648,UM,Sydney,Creative Agency,Australia,False
2124,MediaCom,London,Creative Agency,UK,False
...,...,...,...,...,...
1183,Ginga Communications,Sao Paulo,Creative Agency,Brazil,True
944,F.Biz,Sao Paulo,Creative Agency,Brazil,True
1845,Lew'Lara\TBWA,Sao Paulo,Creative Agency,Brazil,False
3484,The Electric Factory,Montevideo,Creative Agency,Uruguay,True
2715,PMG Worldwide,Fort Worth,Creative Agency,USA,True

## Create Agency Market Rank Table

In [89]:
# create the agency_market_rank dataframe
agency_market_rank = merged_df.filter(["ranking_category", "year", "id", "points"], axis=1)
agency_market_rank = agency_market_rank.rename(columns={'id': "agency_id"})
agency_market_rank

     ranking_category  year  agency_id  points
0               media  2019       2163   201.7
1               media  2019       3561   194.0
2               media  2019       2275   186.0
3               media  2019       3648   182.7
4               media  2019       2124   150.4
...               ...   ...        ...     ...
6358            media  2018       3484     3.0
6359            media  2018       3941     3.0
6360            media  2018       1789     2.9
6361            media  2018       4114     2.9
6362            media  2018       2715     2.9

[6363 rows x 4 columns]

In [92]:
# drop any duplicates and remove index
agency_market_rank = agency_market_rank.drop_duplicates(subset=['ranking_category', 'year', 'agency_id'], keep='first')
agency_market_rank

     ranking_category  year  agency_id  points
0               media  2019       2163   201.7
1               media  2019       3561   194.0
2               media  2019       2275   186.0
3               media  2019       3648   182.7
4               media  2019       2124   150.4
...               ...   ...        ...     ...
6358            media  2018       3484     3.0
6359            media  2018       3941     3.0
6360            media  2018       1789     2.9
6361            media  2018       4114     2.9
6362            media  2018       2715     2.9

[6357 rows x 4 columns]

## Agency Product Category Table
This table contains an id for the agency and an id for the product category

1. From "merged_df" split out the product categories and save each of them as a row along with the "id" of the agency.
2. Merge these with "product_categories" df on the "name".
2. Drop, Rename and reorder columns.

In [108]:
# first correct an error I made on the product_category dataframe - the index is actually the "id" column.  It worked above, so I'm not going back, but it needs to be changed here.
new_product_category_df = product_categories
new_product_category_df['id'] = new_product_category_df.index
new_product_category_df.index.name = None
new_product_category_df

                         name  id
1          Financial Services   1
2    Technology & Electronics   2
3   public sector & education   3
4                 Soft Drinks   4
5                    Politics   5
6                  Automotive   6
7          Media & Publishing   7
8                  Non-profit   8
9      Clothing & Accessories   9
10       Telecoms & Utilities  10
11    Leisure & Entertainment  11
12     Toiletries & Cosmetics  12
13                       Food  13
14      Business & Industrial  14
15           Alcoholic Drinks  15
16        Transport & Tourism  16
17       Household & Domestic  17
18                     Retail  18
19                    Tobacco  19
20        Pharma & Healthcare  20

In [109]:
# create a series by concatenating each split value then iterate rows to write df
agency_product_category_df = pd.concat([pd.Series(row['id'], row['product_category'].split(','))              
    for _, row in merged_df.iterrows()]).reset_index()

agency_product_category_df = agency_product_category_df.rename(columns={0:"agency_id", "index": "name"})

# strip any leading or trailing spaces
agency_product_category_df['name'] = agency_product_category_df['name'].str.strip()

agency_product_category_df

                           name  agency_id
0          Household & Domestic       2163
1        Toiletries & Cosmetics       2163
2                        Retail       3561
3                   Soft Drinks       3561
4           Transport & Tourism       3561
...                         ...        ...
10688    Toiletries & Cosmetics       3484
10689      Telecoms & Utilities       3941
10690  Technology & Electronics       1789
10691       Transport & Tourism       4114
10692  Technology & Electronics       2715

[10693 rows x 2 columns]

In [116]:
# merge and clean up


merged_product_category = pd.merge(agency_product_category_df, new_product_category_df, how="left", on=["name"])
merged_product_category = merged_product_category.rename(columns={'id': "product_category_id"})
merged_product_category = merged_product_category.drop(columns=['name'])

merged_product_category = merged_product_category.drop_duplicates()
merged_product_category

       agency_id  product_category_id
0           2163                   17
1           2163                   12
2           3561                   18
3           3561                    4
4           3561                   16
...          ...                  ...
10682       1845                    3
10688       3484                   12
10689       3941                   10
10691       4114                   16
10692       2715                    2

[8272 rows x 2 columns]

## Brand Market Rank Table
1. Import .csv files
2. Clean up and add brand id.
3. Create product_category id.

In [125]:
# file directory to import from
brand_files = os.listdir('../data_tues/brands/')
brand_files

['2018-media-brands.csv',
 '2019-effective-brands.csv',
 '2019-creative-brands.csv',
 '2018-creative-brands.csv',
 '2019-media-brands.csv',
 '2020-effective-brands.csv',
 '2018-effective-brands.csv',
 '2020-creative-brands.csv',
 '2020-media-brands.csv']

In [126]:
# function to import data from csv and add columns for year and category from file name
def load_files(filenames):
    regex = re.compile(r'^(\d{4})-(\w+)-brands\.csv$')
    matches = [m for m in map(regex.match, filenames) if m is not None]

    for match in matches:
	    yield (
            pd.read_csv('../data_tues/brands/' + match.group(0))
            .assign(year=match.group(1), ranking_category=match.group(2)) 
            .astype({'year': 'int', 'ranking_category': 'string'}) 
        )
		
brands_data = pd.concat(load_files(brand_files))
brands_data = brands_data.rename(columns={'Brand': "brand", 'Product Category': 'product_category', "Points": "points"})

brands_data = brands_data.filter(["ranking_category", "year", "brand", "product_category", "points"], axis=1)

brands_data = brands_data.dropna(subset=['brand'])


brands_data

,ranking_category,year,brand,product_category,points
0,media,2018,Nike,Clothing & Accessories,297.5
1,media,2018,McDonald's,Retail,263.7
2,media,2018,Snickers,Food,227.9
3,media,2018,Dove,Toiletries & Cosmetics,204.5
4,media,2018,Netflix,Media & Publishing,194.5
...,...,...,...,...,...
506,media,2020,Eclipse,Food,2.1
507,media,2020,BBVA,Financial Services,2.0
508,media,2020,Gasco,Business & Industrial,2.0
509,media,2020,Asociación Mutual Israelita Argentina,"Non-profit, public sector & education",2.0
510,media,2020,Lidl,Retail,2.0

In [151]:
# clean up and drop extaneous column, drop duplicates
brands_df = brands_data.drop(columns="product_category")
brands_df = brands_df.drop_duplicates(subset=['ranking_category', 'year', 'brand'], keep='first')
brands_df

    ranking_category  year                                  brand  points
0              media  2018                                   Nike   297.5
1              media  2018                             McDonald's   263.7
2              media  2018                               Snickers   227.9
3              media  2018                                   Dove   204.5
4              media  2018                                Netflix   194.5
..               ...   ...                                    ...     ...
506            media  2020                                Eclipse     2.1
507            media  2020                                   BBVA     2.0
508            media  2020                                  Gasco     2.0
509            media  2020  Asociación Mutual Israelita Argentina     2.0
510            media  2020                                   Lidl     2.0

[4808 rows x 4 columns]

## Brand Product Categories Table

In [140]:
# create a series by concatenating each split value then iterate rows to write df
split_brands_df = pd.concat([pd.Series(row['brand'], row['product_category'].split(','))              
    for _, row in brands_data.iterrows()]).reset_index()

split_brands_df = split_brands_df.rename(columns={0:"brand", "index": "product_category"})

# strip any leading or trailing spaces
split_brands_df['product_category'] = split_brands_df['product_category'].str.strip()

split_brands_df

               product_category                                  brand
0        Clothing & Accessories                                   Nike
1                        Retail                             McDonald's
2                          Food                               Snickers
3        Toiletries & Cosmetics                                   Dove
4            Media & Publishing                                Netflix
...                         ...                                    ...
5604         Financial Services                                   BBVA
5605      Business & Industrial                                  Gasco
5606                 Non-profit  Asociación Mutual Israelita Argentina
5607  public sector & education  Asociación Mutual Israelita Argentina
5608                     Retail                                   Lidl

[5609 rows x 2 columns]

In [145]:
# merge in the brand id and drop the product category column

# merge tables
brands_product_categories = pd.merge(split_brands_df, new_product_category_df, how="left", left_on=["product_category"], right_on=["name"])

brands_product_categories = brands_product_categories.rename(columns={'id': "product_category_id"})

brands_product_categories = brands_product_categories.filter(["brand", "product_category_id"], axis=1)

brands_product_categories

                                      brand  product_category_id
0                                      Nike                    9
1                                McDonald's                   18
2                                  Snickers                   13
3                                      Dove                   12
4                                   Netflix                    7
...                                     ...                  ...
5604                                   BBVA                    1
5605                                  Gasco                   14
5606  Asociación Mutual Israelita Argentina                    8
5607  Asociación Mutual Israelita Argentina                    3
5608                                   Lidl                   18

[5609 rows x 2 columns]

In [146]:
# remove duplicate rows
brands_product_categories = brands_product_categories.drop_duplicates()

# Write the data to the Postgresql database
1. Connect to Postgres - create engine.
2. Import Username and Password from config.
3. write each table to db.

In [ ]:
# agency table
agency_df.to_sql('agency', engine, if_exists='append')

In [ ]:
# agency_market_rank table
agency_market_rank.to_sql('agency_market_rank', engine, index=False, if_exists='append')

In [ ]:
# agency_product_category table
merged_product_category.to_sql('agency_product_category', engine, index=False, if_exists='append')

In [ ]:
# brand_market_rank table
brands_df.to_sql('brand_market_rank', engine, index=False, if_exists='append')

In [150]:
# brand_product_categories table
brands_product_categories.to_sql('brand_product_categories', engine, index=False, if_exists='append')